baradoid/ask-uch/lpc812-sm/src/httpService.c
	char numToStr[5];
	//startSendWifiDataWithLen(1908, curConnInd, sendBufIdx++);

	sendWifiDataToBuf(svgStr1, curConnInd);
	//wifiPrintf(svgStr1);

	strcpy(bufStr, "<line x1=\"0\" y1=\"   \" x2=\"400\" y2=\"   \"/>\r\n");
	int i,j, k;
	for(i=0, j=20; i<7; i++, j+=20){
		itoa(j, numToStr, 10);
		uint8_t sl = strlen(numToStr);
		memcpy(&(bufStr[17]), numToStr, sl);
		memcpy(&(bufStr[35]), numToStr, sl);
		sendWifiDataToBuf(bufStr, curConnInd);
		//wifiPrintf(bufStr);
	}

	sendWifiDataToBuf(svgStr2, curConnInd);
	//wifiPrintf(svgStr2);

	strcpy(bufStr, "<text x=\"2\" y=\"   \">   </text>\r\n");
	for(i=0, j=155, k=(minVal-gap); i<8; i++, j-=20, k+=delta){
		itoa(j, numToStr, 10);
		uint8_t sl = strlen(numToStr);
		bufStr[15+2]=' ';
		memcpy(&(bufStr[15]), numToStr, sl);

		itoa(k, numToStr, 10);
		sl = strlen(numToStr);
		//bufStr[20+2]=' ';
		memcpy(&(bufStr[20]), numToStr, sl);

		sendWifiDataToBuf(bufStr, curConnInd);
		//wifiPrintf(bufStr);
	}
	sendWifiDataToBuf("</g>\r\n", curConnInd);
	//wifiPrintf("</g>\r\n");

	sendWifiDataToBuf("<g style=\"fill: rgb(254,254,127); stroke: black;\">\r\n", curConnInd);
	//wifiPrintf("<g style=\"fill: rgb(254,254,127); stroke: black;\">\r\n");
	strcpy(bufStr, "<rect x=\"25 \" y=\"110\" width=\"25\" height=\"350\"/>\r\n");
	for(i=0, j=25; i<12; i++, j+=30){

		itoa(j, numToStr, 10);
		uint8_t sl = strlen(numToStr);
		memcpy(&(bufStr[9]), numToStr, sl);

		uint8_t y = 40+rand() % 100;
		itoa(y, numToStr, 10);
		sl = strlen(numToStr);
		bufStr[19] = ' ';
		memcpy(&(bufStr[17]), numToStr, sl);

		sendWifiDataToBuf(bufStr, curConnInd);
		//wifiPrintf(bufStr);
	}
	//sendWifiDataToBuf("</g>\r\n", curConnInd, true);

	sendWifiDataToBuf("</g>\r\n<g font-size=\"10\" font-weight=\"bold\" text-anchor=\"middle\">\r\n", curConnInd);

	//wifiPrintf("</g>\r\n<g font-size=\"10\" font-weight=\"bold\" text-anchor=\"middle\">\r\n");

	strcpy(bufStr, "<text x=\"37 \" y=\"155\">-11h</text>\r\n");
	for(i=0, j=-11, k=37; i<12; i++, j++, k+=30){

		bufStr[24] = ' ';
		bufStr[25] = ' ';
		itoa(j, numToStr, 10);
		strcat(numToStr, "h");
		uint8_t sl = strlen(numToStr);
		memcpy(&(bufStr[22]), numToStr, sl);

		itoa(k, numToStr, 10);
		sl = strlen(numToStr);
		memcpy(&(bufStr[9]), numToStr, sl);

		sendWifiDataToBuf(bufStr, curConnInd);
		//wifiPrintf(bufStr);
		//wifiPrintf("<text x=\"37 \" y=\"155\">-11h</text>\r\n");
	}
	//sendWifiDataToBuf("</g>\r\n", curConnInd, true);

	//sendWifiDataToBuf("<rect height=\"160\" width=\"400\" style=\"stroke:black; fill:none\"/>\r\n", curConnInd, true);
	//sendWifiDataToBuf("</svg></br></br>\r\n", curConnInd, true);

	wifiPrintf("</g>\r\n<rect height=\"160\" width=\"400\" style=\"stroke:black; fill:none\"/>\r\n</svg></br></br>\r\n");
	sendWifiDataToBuf("</g>\r\n<rect height=\"160\" width=\"400\" style=\"stroke:black; fill:none\"/>\r\n</svg></br></br>\r\n", curConnInd);
	//sendWifiDataToBuf("</svg></br></br>\r\n", curConnInd, true);

	//blockWaitSendOK();
	//blockWaitRecvBytesReport(true);
}


__RAM_FUNC uint16_t parseInt16(char *str)
{
	uint8_t i, shift = 0;
	uint16_t  ret=0;
	for(i=0; i<4; i++){

		if( (str[i]>=0x30) && (str[i]<=0x39) )
			shift = 0x30;
		else if( (str[i]>=0x41) && (str[i]<=0x46) )
			shift = 0x37;
		else if( (str[i]>=0x61) && (str[i]<=0x66) )
			shift = 0x57;

		ret |= ((str[i] - shift)<<(i*4));
	}
	return ret;
}

__RAM_FUNC uint8_t parseInt8(char *str) //отладить
{
	uint8_t i, ret=0, shift = 0;
	for(i=0; i<2; i++){

		if( (str[i]>=0x30) && (str[i]<=0x39) )
			shift = 0x30;
		else if( (str[i]>=0x41) && (str[i]<=0x46) )
			shift = 0x37;
		else if( (str[i]>=0x61) && (str[i]<=0x66) )
			shift = 0x57;

		ret |= ((str[i] - shift)<<(i*4));
	}
	return ret;
}

__RAM_FUNC inline int8_t convertTwosCompl(int8_t a) {
  //if (a < 0)
//    a = ( ~-a|128 ) + 1;

  return ~a + 1;
}


#define DATA 1
#define NOTDATA 2
#define ESA 3
#define EOF 4

__RAM_FUNC uint8_t parseData(char *recvBuf, uint8_t data[], uint8_t *dLen, uint16_t *dAddr)
{
	char numToStr[10];
	if(recvBuf[0] != ':'){
		debugPrintf(" not data\r\n");
		return NOTDATA;
	}


	uint8_t dType=0, dCrc = 0;

	char *parsePtr = &(recvBuf[1]);
	*dLen = parseInt8(parsePtr);
	parsePtr+=2;
	*dAddr = parseInt16(parsePtr);
	parsePtr+=4;
	dType = parseInt8(parsePtr);
	parsePtr+=2;

	debugPrintf("l");
	itoa(*dLen, numToStr, 16);
	debugPrintf(numToStr);
	debugPrintf(".a");
	itoa(*dAddr, numToStr, 16);
	debugPrintf(numToStr);
	debugPrintf(".t");
	itoa(dType, numToStr, 16);
	debugPrintf(numToStr);
	debugPrintf(" ");

	uint8_t cc = 0;
	cc+=*dLen;
	cc+=dType;
	cc+=(*dAddr&0xff);
	cc+=((*dAddr>>8)&0xff);

	uint8_t i;
	for(i=0;i<*dLen;i++){
		data[i] = parseInt8(parsePtr);
		cc += data[i];
		parsePtr += 2;

		itoa(data[i], numToStr, 16);
		debugPrintf(numToStr);
		debugPrintf(".");
	}
	debugPrintf("\r\n");

	cc = convertTwosCompl(cc);
	/*debugPrintf(" cc");
	itoa(cc, numToStr, 16);
	debugPrintf(numToStr);*/

	dCrc = parseInt8(parsePtr);
	/*debugPrintf(" c");
	itoa(dCrc, numToStr, 16);
	debugPrintf(numToStr);


	debugPrintf(" chs >> ");
	debugPrintf("data:");*/
	if(dCrc != cc){
		debugPrintf(" crc fail! \r\n");
		return NOTDATA;
	}
	if(dType == 3)
		return ESA;
	else if(dType == 1)
		return EOF;

	return DATA;
	//debugPrintflen(recvBuf, wifiMsgLen);
}

__RAM_FUNC void getFirmware(TCmd *cmd, char *recvBuf)
{
	char numToStr[10];
	int16_t wifiMsgLen = 0;
	int32_t contentLength = cmd->contentLength;

	int16_t curPacketLenLeft = 0;
	uint8_t curConnInd;

	//uint8_t presSecRet1 = 0, eraseSecRet = 0, presecSecRet2 = 0, ret;
	uint8_t ret = 0;
	 uint32_t SystemCoreClock1000 = SystemCoreClock / 1000;

	char msg1[] = " getFirmware s=> Chip_IAP_PreSectorForReadWrite ret \r\n";
	char msg2[] = " getFirmware s=> Chip_IAP_EraseSector ret \r\n";
	char msg3[] = "skip\r\n";
	char msg4[] = "end\r\n";
	char msg5[] = " getFirmware s=> Chip_IAP_PreSectorForReadWrite ret \r\n";
	char msg6[] = " getFirmware s=> start \r\n";
	__disable_irq();

	NVIC_DisableIRQ(UART1_IRQn);
	NVIC_DisableIRQ(SysTick_IRQn);

	uint8_t i;
//	for(i=0; i<16; i++){
//		if( (i != 3) && (i != 2)  && (i != 1) && (i != 0)){
			//ret = Chip_IAP_PreSectorForReadWrite(i, i);
			//debugPrintf(msg1);
//			ret = Chip_IAP_EraseSectorExt(i, i, SystemCoreClock1000);
		//	debugPrintf(msg2);
//		}
//		else{
//			debugPrintf(msg3);
//		}
	//}
	//debugPrintf(msg4);

