baradoid/ask-uch/lpc812-sm/src/httpService.c
	//__disable_irq();
	//ret = Chip_IAP_PreSectorForReadWrite(0, 15);
	//__enable_irq();

	//itoa(ret, numToStr, 10);
	debugPrintf(msg5);
	//debugPrintflen(numToStr);
	//debugPrintf("\r\n");

	/*debugPrintf(" == > ");
	itoa(presSecRet1, numToStr, 10);
	debugPrintf(numToStr);
	debugPrintf(" == > ");
	itoa(eraseSecRet, numToStr, 10);
	debugPrintf(numToStr);
	debugPrintf(" == > ");
	itoa(presecSecRet2, numToStr, 10);
	debugPrintf(numToStr);
	debugPrintf(" \r\n ");*/

	debugPrintf(msg6);

	//NVIC_SystemReset();
	uint8_t data[256],*pPtr = data;
	int16_t dstartAddr = -1, blockLen=0;
	while(1){
		wifiMsgLen = getWifiNextString(recvBuf);
		//wifiMsgLen = recvWifiMsgBlocking(recvBuf);

		debugPrintf(recvBuf);
		//debugPrintflen(recvBuf, wifiMsgLen);
		//debugPrintf(" getFirmware s=>");
		//debugPrintflen(recvBuf, wifiMsgLen);

		if(dstartAddr == -1){
			pPtr = data;
			blockLen = 0;
			memset(data, 0, 256);
		}
		uint8_t dLen;
		uint16_t dAddr = 0;
		ret = parseData(recvBuf, pPtr, &dLen, &dAddr);
		if(ret == DATA){
			if(dstartAddr == -1){
				dstartAddr = dAddr;
			}
			pPtr += dLen;
			blockLen += dLen;

			itoa(blockLen, numToStr, 10);
			debugPrintf(" getFirmware s=>");
			debugPrintf(numToStr);
			debugPrintf("\r\n");
		}
		if((ret == EOF) || (blockLen >= 128)){
			debugPrintf(" getFirmware s=> flashing\r\n");

			__disable_irq();
			ret = Chip_IAP_PreSectorForReadWrite(0, 15);
			ret = Chip_IAP_CopyRamToFlash(dstartAddr, (uint32_t*)data, blockLen);
			__enable_irq();
			itoa(ret, numToStr, 10);
			debugPrintf(" getFirmware s=> Chip_IAP_PreSectorForReadWrite ret ");
			debugPrintf(numToStr);
			debugPrintf("\r\n");

			dstartAddr = -1;
		}
	}
	NVIC_SystemReset();
	return;

	debugPrintf(" getFirmware s=> wait for IPD \r\n");
	while(1){
		wifiMsgLen = recvWifiMsg(recvBuf);
		debugPrintf(" getFirmware s=>");
		debugPrintflen(recvBuf, wifiMsgLen);
		if(recvBuf[0] == '+'){
			char *pch = strstr(recvBuf, "+IPD");
			if(pch != NULL){
				debugPrintf(" getFirmware s=> IPD detected. \r\n");
				//char *msg;
				parseIPD(recvBuf, &curConnInd, &curPacketLenLeft);
				debugPrintf(" getFirmware s=> msg:");
				debugPrintf(recvBuf);
				debugPrintf("\r\n");
				break;
			}
		}
	}

	debugPrintf(" getFirmware s=> wait for data \r\n");
	while(1){
		wifiMsgLen = recvWifiMsg(recvBuf);
		curPacketLenLeft -= wifiMsgLen;

		debugPrintf(" getFirmware s=>");
		debugPrintflen(recvBuf, wifiMsgLen);
		if(recvBuf[0] == ':'){
			debugPrintf(" getFirmware s=>Data start detected\r\n");
			break;
		}
	}
	debugPrintf(" getFirmware s=>Start Data recv ==== \r\n");
	debugPrintflen(recvBuf, wifiMsgLen);
	char dataBuffer[50];
	while(1){
		wifiMsgLen = recvWifiMsg(recvBuf);
		debugPrintf(" getFirmware s=>");
		debugPrintflen(recvBuf, wifiMsgLen);

		itoa(wifiMsgLen, numToStr, 10);
		debugPrintf(" getFirmware s=>");
		debugPrintf(numToStr);
		debugPrintf("\r\n");

		if(curPacketLenLeft > 0){
			curPacketLenLeft -= wifiMsgLen;

			if((wifiMsgLen-2) >= 3){  //key and Len exists
				uint8_t dLen = 0;
				char *parsePtr = &(recvBuf[1]);
				dLen = parseInt8(parsePtr);

				itoa(dLen, numToStr, 10);
				debugPrintf(" getFirmware s=>dLen=");
				debugPrintf(numToStr);
				debugPrintf("  ");
				itoa((1+2+4+2+dLen*2+2), numToStr, 10);
				debugPrintf(numToStr);
				debugPrintf("\r\n");
				if((wifiMsgLen-2) >= (1+2+4+2+dLen*2+2)){

				}
				else{
					debugPrintf(" getFirmware s=>not enough data\r\n");
				}
			}
			else{
				memcpy(dataBuffer, recvBuf, (wifiMsgLen-2));
				dataBuffer[(wifiMsgLen-2)] = '\0';
				debugPrintf(" getFirmware s=>start fo msg saved");
				debugPrintf(dataBuffer);
				debugPrintf("\r\n");
			}

		}
		else{
			parseIPD(recvBuf, &curConnInd, &curPacketLenLeft);
			debugPrintf(" getFirmware s=> msg:");
			debugPrintf(recvBuf);
			debugPrintf("\r\n");
		}

	}
	return;

	while(contentLength > 0){
		//waitWifiMsgAndStartRecv();
		wifiMsgLen = recvWifiMsg(recvBuf);
		debugPrintf(" getFirmware s=> recvBuf:");
		//debugPrintf(recvBuf);
		debugPrintflen(recvBuf, wifiMsgLen);
		debugPrintf("\r\n");
		//char *msg;

		parseIPD(recvBuf, &curConnInd, &curPacketLenLeft);

		debugPrintf(" getFirmware s=> msg:");
		debugPrintf(recvBuf);
		debugPrintf("\r\n");

		contentLength -= strlen(recvBuf);
		contentLength -= curPacketLenLeft;

		/*while(msgLength > 0){
			uint16_t wifiMsgLen = waitWifiMsgAndStartRecv();
			debugPrintf(" httpServ => ");
			itoa(msgLength, numToStr, 10);
			debugPrintf(numToStr);
			debugPrintf(" | ");
			itoa(wifiMsgLen, numToStr, 10);
			debugPrintf(numToStr);
			msgLength -= wifiMsgLen;
			debugPrintf("\r\n");
		}*/

		//uint8_t strInd = 0;
		while(curPacketLenLeft > 0){
			wifiMsgLen = recvWifiMsg(recvBuf);
			debugPrintf(" getFirmware->");
			debugPrintflen(recvBuf, wifiMsgLen);
			curPacketLenLeft -= wifiMsgLen;

			/*debugPrintf(" => ");
			itoa(wifiMsgLen, numToStr, 10);
			debugPrintf(numToStr);
			debugPrintf(" rn ");
			itoa(curPacketLenLeft, numToStr, 10);
			debugPrintf(numToStr);
			debugPrintf(" chs >> ");
			itoa(msgLength, numToStr, 10);
			debugPrintf(numToStr);
			debugPrintf(" chs >> ");*/

			if(recvBuf[0] != ':'){
				debugPrintf(" not data\r\n");
				continue;
			}


			uint8_t dLen = 0, dType=0, dData[16], dCrc = 0;
			uint16_t dAddr = 0;

			char *parsePtr = &(recvBuf[1]);
			dLen = parseInt8(parsePtr);
			parsePtr+=2;
			dAddr = parseInt16(parsePtr);
			parsePtr+=4;
			dType = parseInt8(parsePtr);
			parsePtr+=2;

			/*debugPrintf("l");
			itoa(dLen, numToStr, 16);
			debugPrintf(numToStr);
			debugPrintf(".a");
			itoa(dAddr, numToStr, 16);
			debugPrintf(numToStr);
			debugPrintf(".t");
			itoa(dType, numToStr, 16);
			debugPrintf(numToStr);
			debugPrintf(" ");*/

			uint8_t cc = 0;
			cc+=dLen;
			cc+=dType;
			cc+=(dAddr&0xff);
			cc+=((dAddr>>8)&0xff);
			uint8_t i;
			for( i=0;i<dLen;i++){
				dData[i] = parseInt8(parsePtr);
				cc += dData[i];
				parsePtr += 2;

				/*itoa(dData[i], numToStr, 16);
				debugPrintf(numToStr);
				debugPrintf(".");*/
			}

			cc = convertTwosCompl(cc);
			/*debugPrintf(" cc");
			itoa(cc, numToStr, 16);
			debugPrintf(numToStr);*/

			dCrc = parseInt8(parsePtr);
			/*debugPrintf(" c");
			itoa(dCrc, numToStr, 16);
			debugPrintf(numToStr);


			debugPrintf(" chs >> ");
			debugPrintf("data:");*/
			if(dCrc != cc)
				debugPrintf(" crc fail! \r\n");
			//debugPrintflen(recvBuf, wifiMsgLen);

