baradoid/ask-uch/lpc812-sm/src/httpService.c
		}

		itoa(contentLength, numToStr, 10);
		debugPrintf("-----> ");
		debugPrintf(numToStr);
		debugPrintf("\r\n");
	}
	debugPrintf(" ---- firmware end ----  \r\n");
}

__RODATA(text) char statusText1[] = "Wifi AP status: ON with name \"ESP_9DACCD\" with ip ";
__RODATA(text) char statusText2[] = "</br>Wifi client status: connected on \"TL-WR842ND\" with ip ";
__RODATA(text) char statusText3[] = "</br></br>Uptime: ";

#define DEBUGPRINTF
void vHttpServerTask ()
{
	char htmlBody[1004], recvBuf[BUF_LEN];

	TCmd cmd;
	getNextWifiCmdExtBuf(recvBuf, &cmd, INFINITY);

	debugPrintf("httpTask->");
	debugPrintf(recvBuf);
	debugPrintf("\r\n");

	//debugPrintf("start process \r\n");

	if(cmd.type == IPD){
		//debugPrintf("!!! IPD !!!\r\n");
		if(cmd.htmlReqType == GET_ROOT){
			debugPrintf("httpTask-> !!! GET_ROOT !!!\r\n");
			extern uint64_t SysTickCnt;
			uint32_t startGenPage =  (uint32_t)SysTickCnt;

			sendWifiDataToBuf(htmlPart1, cmd.curConnInd);
			strcpy(htmlBody, statusText1);
			strcat(htmlBody, APIP);
			strcat(htmlBody, statusText2);
			strcat(htmlBody, STAPIP);
			strcat(htmlBody, statusText3);

			char numToStr[10];
			itoa(SysTickCnt/(24*3600*1000), numToStr, 10);
			strcat(htmlBody, numToStr);
			strcat(htmlBody, "d ");

			itoa(SysTickCnt/(3600*1000), numToStr, 10);
			strcat(htmlBody, numToStr);
			strcat(htmlBody, "h ");

			itoa(SysTickCnt/(60*1000), numToStr, 10);
			strcat(htmlBody, numToStr);
			strcat(htmlBody, "m ");

			itoa(SysTickCnt/1000, numToStr, 10);
			strcat(htmlBody, numToStr);
			strcat(htmlBody, "s ");
			sendWifiDataToBuf(htmlBody, cmd.curConnInd);

			sendWifiDataToBuf(htmlPartStartSec2, cmd.curConnInd);

			debugPrintf("!!! start send SVG!!!\r\n");
			//uint32_t cntVals[12];int
			int i;
			for(i=0; i<4; i++){
	//					cntVals[0] = rand() % 100;
	//					for(int j=1; j<12; j++){
	//						cntVals[j] += rand() % 100;
	//					}
	//			sendSvgData(htmlBody, cmd.curConnInd/*, cntVals*/);
			}
			debugPrintf("!!! stop send SVG!!!\r\n");
			sendWifiDataToBuf(htmlPartStartSec3, cmd.curConnInd);
			//sendWifiData(htmlPart3, curConnInd);

#ifdef DEBUGPRINTF
			debugPrintf("!!! htmlSend0 SEND_OK detected!!!\r\n");
#endif

			prepareHtmlData(htmlBody);

			sendWifiDataToBuf(htmlBody, cmd.curConnInd);

#ifdef DEBUGPRINTF
			debugPrintf("!!! htmlBody SEND_OK detected!!!\r\n");
#endif

			sendWifiDataToBuf("<center>Page generate in ", cmd.curConnInd);

			itoa(SysTickCnt - startGenPage, htmlBody, 10);
			//debugPrintf(htmlBody);
			//debugPrintf(" for page generate\r\n");
			sendWifiDataToBuf(htmlBody, cmd.curConnInd);
			sendWifiDataToBuf(" ms</center>", cmd.curConnInd);

			sendWifiDataToBuf(htmlPart2, cmd.curConnInd);


#ifdef DEBUGPRINTF
			debugPrintf("!!! htmlClose SEND_OK detected!!!\r\n");
#endif

			//sendCipClose(cmd.curConnInd);

			//waitForRespOK();
		}
		else if(cmd.htmlReqType == POST){
			debugPrintf("httpTask-> !!! POST !!!\r\n");
			getFirmware(&cmd, recvBuf);
		}
		else{
			debugPrintf("httpTask-> not ROOT. send 404\r\n");
			sendWifiData(html404, cmd.curConnInd);
	//				wifiPrintf("AT+CIPSEND=");
	//				debugPrintf("AT+CIPSEND=");
	//				itoa(curConnInd, numToStr, 10);
	//				wifiPrintf(numToStr);
	//				debugPrintf(numToStr);
	//				wifiPrintf(",");
	//				debugPrintf(",");
	//				itoa(strlen(&(html404[0])), numToStr, 10);
	//				wifiPrintf(numToStr);
	//				debugPrintf(numToStr);
	//				wifiPrintf("\r\n");
	//				debugPrintf("\r\n");

			while(1){
				getNextWifiCmd(&cmd, INFINITY);

				if( cmd.type == ready_to_send){
					break;
				}

				if( cmd.type == CMD_CLOSED){
#ifdef DEBUGPRINTF
					debugPrintf("detect CLOSED \r\n");
#endif
					//eState = waitForCmd;
					break;
				}
			}
#ifdef DEBUGPRINTF
				debugPrintf("!!! htmlSend0 ready_to_send detected!!!\r\n");
#endif
			wifiPrintf(&(html404[0]));

			while(1){
				getNextWifiCmd(&cmd, INFINITY);

				if( cmd.type == RESP_SEND_OK){
					break;
				}
			}
#ifdef DEBUGPRINTF
			debugPrintf("!!! html404 SEND_OK detected!!!\r\n");
#endif
			//eState = waitForCmd;
		}
	}
	return;
//}


//	static uint8_t tempRecvBufInd = 0;

//	while(RingBuffer_Pop(&rxring, &(tempRecvBuf[tempRecvBufInd]))){
//		if( (tempRecvBuf[tempRecvBufInd] == '\n') ||
//			((tempRecvBuf[0] == '>') && (tempRecvBufInd==1))
//		  )
//		{
//			tempRecvBufInd++;
//			tempRecvBuf[tempRecvBufInd] = '\0';
//
//			if(tempRecvBufInd >= TEMPRECVBUF_SIZE)
//				errword |= (1<<UARTTMPBUF_FULL_BITNUM);
//			//tempRecvBufInd++;
//			//uint16_t tempRecvBufLen = sizeof(tempRecvBuf);
//			Chip_UART_SendBlocking(LPC_USART0, tempRecvBuf, tempRecvBufInd);
//			TCmdType cmdType = UNKNWON;
//			parseCommand(cmdType, tempRecvBuf);
//			processMsg(cmdType, tempRecvBufInd);
//			tempRecvBufInd = 0 ;
//		}
//		else{
//			if((msgLength > 0) && (tempRecvBufInd == (msgLength-1))){
//				tempRecvBufInd++;
//				tempRecvBuf[tempRecvBufInd] = '\0';
//				debugPrintf("!!! affected !!! \r\n");
//				Chip_UART_SendBlocking(LPC_USART0, tempRecvBuf, tempRecvBufInd);
//				TCmdType cmdType = TEXT;
//				processMsg(cmdType, tempRecvBufInd);
//				tempRecvBufInd = 0 ;
//			}
//			else
//				tempRecvBufInd++;
//		}
//	}
}


void parseHttpReq(char *str, THtmlReqType *htmlReqType)
{
	char *pch;
	uint8_t argInd = 0;
	debugPrintf(" parseHttpReq->");
	debugPrintf(str);
	debugPrintf("\r\n");

	pch = strtok (str, " ");
	while(pch != NULL){
		//debugPrintf(pch);
		//debugPrintf("\r\n");

		if(argInd == 0){
			if(strcmp(pch, "GET") == 0){
				debugPrintf(" httpReqParsing-> GET_ROOT\r\n");
				*htmlReqType = GET_ROOT;
			}
			if(strcmp(pch, "POST") == 0){
				debugPrintf(" httpReqParsing-> POST\r\n");
				*htmlReqType = POST;
			}
		}
		if(argInd == 1){
			if(strcmp(pch, "/") == 0){
				//debugPrintf(" GET_ROOT detected\r\n");
				//cmd.htmlReqType = GET_ROOT;
			}
			else if(strcmp(pch, "/favicon.ico") == 0){
				//debugPrintf(" GET_FAVICON detected\r\n");
				*htmlReqType = GET_FAVICON;
			}
		}

		pch = strtok (NULL, " ");
		argInd++;
	}

	//debugPrintf(" ! parse http req ! stop\r\n");
}

void parsePostReqHead(char *str, TCmd *cmd, uint16_t msgLen, uint8_t strInd)
{
	char numToStr[10];
	debugPrintf(" postReqhead-> ");
	if(strInd == 2){
		debugPrintf(" conn len! ");
		char *pch = strtok (str, " ");
		pch = strtok (NULL, " ");
		if(pch != NULL){
			debugPrintf(pch);
			char numToStr[10];
			cmd->contentLength = atoi(pch);
		}
		debugPrintf(" \r'n");
	}
	itoa(strInd, numToStr, 10);
	debugPrintf(numToStr);
	debugPrintf(" ");

	debugPrintf(str);


}

void parsePostReq(char *str, uint16_t msgLen, uint8_t strInd)
{
	char numToStr[10];
	debugPrintf(" postReq-> ");
	itoa(strInd, numToStr, 10);
	debugPrintf(numToStr);
	debugPrintf(" ");

	debugPrintf(str);
}

